import sys,os,time,asyncio,json

root_dir = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
sys.path.append(root_dir)

from Commons import async_post

#server_url = 'http://localhost:30090/reranker'
server_url = 'http://1.116.122.151:30090/reranker'

async def get_reranker_results(query : str,texts : list,top_k=10,min_score=0.1):
    rdata = {'query':query,"texts":texts,"top_k":top_k,"min_score":min_score}
    status,resp_text = await async_post(server_url,rdata,retires=5)
    json_data = json.loads(resp_text)
    if 'result' in json_data:
        return json_data['result']
    #获取失败返回None
    return None
if __name__ == '__main__':
    start_time = time.time()
    query = "膳魔师趴趴折耳兔款双头保温杯"
    choices = [
        "【产品介绍】星巴克桂花绵云拿铁\n\n秋日金桂萦绕鼻间的清甜幽香融入这杯燕麦拿铁。细密的燕麦绵云顶盖，燕麦奶融合桂花风味搅打的植基奶沫，入口是冷冽清甜的桂花风味，包裹谷物香在口中流转，少一份甜腻，多一份醇厚绵密。\n\n【推荐话术】\n秋天的桂花风味融入绵云拿铁，入口绵密而不甜腻。\n\n【提醒】\n1.顶部绵云使用燕麦奶制作\n2.顶部绵云添加的花味固体饮料粉，舀取时用15ml勺平刮一勺即可\n3.针对客制化奶制品仅针对主体奶，绵云的云不做客制化\n\n【以大杯热版制作为例】\n1.奶沫壶中100ml燕麦奶，一平勺花味固体饮料（15ml勺），4号键搅打\n2.燕麦奶加至蒸奶壶中杯刻线处，蒸奶\n3.杯中加入4泵桂花风味调味糖浆（7.5ml/泵），2份浓缩咖啡\n4.用勺子挡住奶泡，倒奶至距杯口24毫米（约2指）处\n5.以旋转的方式，由外而内的倒入桂花奶沫，顶部轻撒桂花粉左右来回3下",
        "【产品介绍】星巴克桂花冰震浓缩\n\n冰震浓缩系列与秋日金桂的美妙结合。将浓缩咖啡、桂花风味糖浆和冰块一起震摇，撞出轻盈泡沫和馥郁风味。燕麦奶的醇厚谷物芬芳间点缀清甜桂花风味，每一口都带来属于秋日的馥郁芬芳和变幻交织的味蕾体验。\n\n【推荐话术】\n秋天桂花风味的冰震浓缩，口味清甜怡人。\n\n【提醒】\n1.此款饮品只有大杯\n2.大杯仅3泵桂花糖浆\n3.如需使用中杯兑换券等，请在POS上Keyin【星巴克桂花冰震浓缩加三元】按键，核销完兑换券后收取3元。\n4.伙伴工作期间免费饮料直接keyin大杯即可。\n\n【制作方法】\n1. 按2份浓缩咖啡\n2. 冰摇杯内加入3泵（7.5ml/泵）桂花风味糖浆\n3. 冰摇杯内加冰块至大杯④线处\n4. 将浓缩咖啡倒入冰摇杯中，震摇5下\n5. 将饮料连同冰块倒入冰杯中，加燕麦奶至距杯口6mm处\n6. 撒上桂花粉呈一字型（来回3下）",
        "【产品介绍】710ml炫彩鱼鳞款塑料吸管杯\n\n710ml 大容量双层塑料吸管杯，独特标志性星巴克鱼鳞图案杯身，搭配炫彩银色插卡，营造冬日炫酷氛围。\n\n提醒：请伙伴将吸管取出插入杯内进行陈列。",
        "【产品介绍】473ml咖啡渣不锈钢畅饮随行杯配杯套套装\n\n| 特点 | 描述 |\n|------|------|\n| 材质 | 外壁为咖啡渣PP，利用星巴克门店回收的咖啡渣制成，含咖啡豆副产物约40%的聚丙烯材料 |\n| 设计 | 杯身黑色小颗粒为咖啡渣颗粒，搭配哑光古铜金色，低调雅致 |\n| 功能 | 大杯容量不锈钢内杯，保冷保热 |\n| 配件 | 咖啡聚酯纤维面料制成的杯套，方便出行，便携时尚 |",
        "【产品介绍】390ml树桩松鼠造型铭牌款马克杯\n\n马克杯的杯身是仿木纹的树桩造型，不规则的手柄切面增加了使用时的舒适度，logo是古铜色做旧质感的金属牌，异型的硅胶杯盖和树桩杯身更融合。和小松鼠一起，在秋日的午后惬意喝着咖啡，吃着坚果吧~",
        "【产品介绍】473ml咖啡渣双层随行杯配杯套套装\n\n此款咖啡渣双层随行杯，杯子外壁为咖啡渣PP，利用星巴克门店回收的咖啡渣，采用升级技术制成含咖啡豆副产物约40%的聚丙烯材料。杯身的黑色小颗粒就是咖啡渣颗粒哦！\n\n内杯为食品级PP，双层结构可有效防烫，容量473ml对应星巴克大杯。搭配咖啡聚酯纤维面料制成的手提杯套，便携随行，杯套镶嵌金属logo，增添时尚气息。",
        "【产品介绍】435ml暖秋下午茶款保温杯\n\n<p>新款不锈钢保温杯杯型，可以直饮可以倒水，单手可操作，杯盖可做小杯子；白色杯盖带有立体植绒枫叶，秋意浓浓！</p>",
        "【产品介绍】膳魔师趴趴折耳兔款双头保温杯\n\n| 特点 |\n|------|\n| 大容量不锈钢杯，长效保温，双盖设计，可以直饮也可以使用吸管，充满童话感的生动画面设计，美观和实用兼具。 |",
        "【产品介绍】520ml Kambukka枫叶飘飘款感温变色杯\n\n<p>杯身遇到冷水后部分叶子由黄色慢慢变成红色，松鼠俏皮地趴在窗前，看着叶子由黄转红，构成一副转向深秋的动态图景。隐藏式提手方便携带。</p>",
        "【产品介绍】510ml滑雪姜饼人款运动水杯配杯套\n\n<p>这款双饮塑料杯是一款新杯型，可满足多种饮用需求。杯身黑色logo搭配灵动的滑雪姜饼人，杯盖黑色撞色荧光绿，帆布材质的杯套上有刺绣文字。</p>\n\n<p></p>\n\n<p><span style=\"color:#e74c3c;\">提醒：请伙伴将杯子放入杯套内进行陈列。</span></p>",
        "【产品介绍】390ml枫叶花环款不锈钢吸管杯\n\n<p>不锈钢吸管杯杯型，杯身点缀片片落叶环绕logo，搭配立体小松鼠吸管盖帽与长款背带，方便秋日轻松出游。</p>\n\n<p><span style=\"color:#e74c3c;\">提醒：请伙伴将吸管取出插入杯内进行陈列。</span></p>",
        "【产品介绍】860ml咖啡渣玻璃餐盒\n\n此款咖啡渣玻璃餐盒由高硼硅玻璃盒身、咖啡渣PP底座、硅胶内盖及不锈钢外盖组成。其中咖啡渣PP是利用星巴克门店回收的咖啡渣，采用升级技术制成的含咖啡豆副产物约40%的聚丙烯材料。餐盒携带方便，使用简单，外观时尚，适合日常或露营等多种使用场景，快带上它开启环保生活方式吧~",
        "【产品介绍】710ml奶茶色塑料吸管杯\n\n<p>经典榴莲杯的大容量满足家庭办公室大容量饮水需求，哑光雾面奶茶配色低调百搭。</p>\n\n<p><span style=\"color:#e74c3c;\">提醒：请伙伴将吸管取出插入杯内进行陈列。</span></p>",
        "【产品介绍】380ml撞色款马克杯\n\n杯身底部呈现半圆切面，中间为立体浮雕效果的logo，方圆异型的手柄更显运动风格，白色杯身加入了芝麻釉，亮绿色的手柄跳色，提升了杯子的整体亮度。\n\n提醒：请伙伴将搅拌棒放入杯内进行陈列。",
        "【产品介绍】750ml black+blum渐变蓝保温杯\n\n<p>不锈钢本色配上渐变漆，高级感油然而生；超强保温性能。蓝色PU提手，露营户外方便饮水。</p>",
        "【产品介绍】590ml暖暖秋日款不锈钢杯\n\n| 特点 |\n|------|\n| 新颖不锈钢杯型，搭配茶水分离杯盖，杯身印有经典女神logo与落叶松鼠图案，配置麂皮绒材质杯套和可拆卸毛绒小松鼠挂件，暖暖秋日气息。 |",
        "【产品介绍】490ml热点图款感温变色保温杯\n\n<p>经典保温杯杯型，蓝色渐变杯身具有感温变色效果，手握即可变色，杯盖配有提手，整体简约大气又潮范十足。</p>",
        "【产品介绍】450ml枫叶叠叠款玻璃吸管杯\n\n<p>新款玻璃杯，杯身采用硅胶杯套包裹设计配上立体枫叶，隔热防滑，搭配双饮口杯盖，吸管饮用和直饮都可以，满足不同场景和需求。</p>",
        "【产品介绍】473ml奶茶色渐变冰花款不锈钢吸管杯\n\n透明拱型上盖中红、橘、金三色枫叶片体现秋天枫叶飘落的情境，杯身温润的配色加上哑面冰花漆呈现自然纹理，杯身LOGO以金属花纸表现，整体高贵简约手感舒适。\n\n提醒：请伙伴将吸管取出插入杯内进行陈列。",
        "【产品介绍】410ml森林蘑松造型玻璃杯\n\n<p>玻璃杯整体造型为一个蘑菇屋，杯盖使用了双色喷漆，营造出日落下氛围，杯身是立体浮雕的松鼠、落叶和logo，电镀喷漆的效果让杯身在光线下切换出不同的颜色。</p>",
        "【产品介绍】450ml松鼠木纹款马克杯\n\n<p>经典陶瓷马克杯杯型，白色杯身雕刻树桩纹路，搭配可爱硅胶防尘杯盖，片片落叶里坐着小松鼠更加的生动可爱。</p>",
        "【产品介绍】500ml极简本色保温杯\n\n| 特点 | 描述 |\n|------|------|\n| 容量 | 500ml大容量 |\n| 材质 | 不锈钢杯身杯盖 |\n| 配件 | PU提手 |\n| 工艺 | 杯身logo为激光雕刻 |\n| 风格 | 整体极简风格 |",
        "【产品介绍】1050ml经典Logo款塑料杯\n\n<p>这是一款大容量轻巧便捷的塑料运动水杯，防漏的设计搭配大拎手，非常方便外出携带。杯身透明金色logo点缀，杯盖的跳色秋意浓浓。</p>",
        "【产品介绍】355ml浮雕枫叶款马克杯配松鼠款搅拌棒\n\n<p>硅胶小松鼠饰品装饰于陶瓷搅拌棒上，杯身上为多层次堆叠的枫叶浮雕，搭配亮金与雾金的枫叶呈现不同细节，杯身为大地色系渐层釉色。</p>\n\n<p></p>\n\n<p><span style=\"color:#e74c3c;\">提醒：请伙伴将搅拌棒放入杯内进行陈列。</span></p>",
        "【产品介绍】473ml松鼠剪影款马克杯\n\n<p>将松鼠蓬松的尾巴作为马克杯的把手造型，经由精细的陶瓷工艺将其刻画出来。杯身上的松鼠剪影则以凹雕工艺呈现，再施以双色渐变釉，以简约的方式呈现秋日的意境。</p>",
        "【产品介绍】桂花馥芮白\n\n秋日金桂融入浓郁醇厚的馥芮白经典咖啡。每一口，清幽淡雅的桂花香在唇齿间绽放，余味中又透着燕麦奶特有的谷物芬芳，简约而悠长饱满。\n\n【推荐话术】\n幽香的桂花融入经典馥芮白咖啡，回味悠长愉悦。\n\n【以大杯热版制作为例】\n1. 燕麦奶至蒸奶壶大杯刻度线，蒸奶\n2. 杯中加入4泵桂花风味调味糖浆，3份精萃浓缩咖啡\n3. 自由倾入发泡燕麦奶至杯子1/2-2/3处后，继续靠近饮料表面倒入发泡燕麦奶至距杯口6毫米处，饮料表面呈现白色圆点\n4. 撒上桂花粉呈一字型（来回3下）",
        "【产品介绍】桂花燕麦雪融拿铁\n\n香草味冰淇淋缓缓融化在热燕麦拿铁的温暖怀抱，入口是冷冽的桂花清甜，包裹奶香和咖啡香味在口中流转。\n\n【推荐话术】\n香草味冰淇淋配上桂花香，给这个闷热的早秋来一点凉意。\n\n【此款饮品只有中杯】\n1. 杯中放入1个冰淇淋球\n2. 杯中加入2泵桂花风味调味糖浆\n3. 蒸奶壶中蒸煮S线燕麦奶，Extra Hot，用奶勺挡住奶泡，倒奶至杯口12毫米处\n4. 用咖啡玻璃杯接取2份精萃浓缩咖啡，淋在冰淇淋球上方\n5. 表面轻撒桂花粉2下"]
    print(asyncio.run(get_reranker_results(query,choices)))
    print('###DONE###',round(time.time()-start_time,2),'s')